do
function run(msg, matches)
  if matches[1] == "الاوامر" then
    return "هلا بيكـ حياتيـ😊❤️ [@"..msg.from.username.."]\n"
  .."  ".."\n"
  ..[[
🤖نورتـ اكو 4 اوامر بالبوتـ📝
〰〰〰〰〰〰〰〰
📝م1 لرؤيهـ اوامرالادمنيهـ والمدراء👮🏻
〰〰〰〰〰〰〰〰
📝م2 لرؤيهـ اوامر الكروبـ👥
〰〰〰〰〰〰〰〰
📝م3 لرؤيهـ اوامر حمايهـ الكروبـ🛠
〰〰〰〰〰〰〰〰
📝م4 لرؤيهـ اوامر المطورينـ🕵
]].."\n"
.."🛠〰〰〰〰〰〰〰〰〰🛠".."\n"
..'🕵ᴅᴇᴠ🕵: @IH_BI'..'\n'
..'🕵ᴄʜ📡: @Team_Advisor'
------------------

  elseif matches[1] == "م1" then
    return "هلا بيكـ حياتيـ😊❤️ [@"..msg.from.username.."]\n"
  .."  ".."\n"
  ..[[
  👮🏻هاي الاوامر مال الادمنيه والمدراء📝
〰〰〰〰〰〰〰〰
!!! كل الاولمر تعمل برد ومعرف !!!
📍رفع ادمن
📍تنزيل ادمن
〰〰〰〰〰〰〰〰
📍رفع اداري
📍تنزيل اداري
〰〰〰〰〰〰〰〰
📍حظر - معرف+ايدي
📍الغاء حظر-معرف+ايدي
〰〰〰〰〰〰〰〰
📍منع + الكلمه
📍الغاء منع + الكلمه
〰〰〰〰〰〰〰〰
📍معرف +رد - كتم
📍الغاء كتم - معرف+رد
📍المكتومين :- لعرض قائمه المكتومين
〰〰〰〰〰〰〰〰
📍قائمه المنع:- اظهار الكلمات الممنوعه
📍تنظيف قائمه المنع:- لمسح كل المنع
〰〰〰〰〰〰〰〰
📍ايدي :- عرض ايدي المجموعه
📍ايدي بالرد :- عرض ايدي شخص 
]].."\n"
.."🛠〰〰〰〰〰〰〰〰〰🛠".."\n"
..'🕵ᴅᴇᴠ🕵: @IH_BI'..'\n'
..'🕵ᴄʜ📡: @Team_Advisor'
------------------


  elseif  matches[1] == "م2" then
    return "هلا بيكـ حياتيـ😊❤️ [@"..msg.from.username.."]\n"
  .."  ".."\n"
  ..[[
👥 اوامـر مال الكـروب 📍
〰〰〰〰〰〰〰〰
📍 ضع ترحيب
📍 ضع صوره
📍 ضع قوانين
📍 ضع وصف 
📍 ضع اسم
📍 ضع  معرف
📍 ضع رابط
📍 الرابط
📍 معلوماتي
📍 معلومات المجموعه
📍 اعدادت الوسائط
]]
.."🛠〰〰〰〰〰〰〰〰〰🛠".."\n"
..'🕵ᴅᴇᴠ🕵: @IH_BI'..'\n'
..'🕵ᴄʜ📡: @Team_Advisor'
------------------

  elseif  matches[1] == "م3" then
    return "هلا بيكـ حياتيـ😊❤️ [@"..msg.from.username.."]\n"
  .."  ".."\n"
  ..[[
  🛠 اوامـــر حمـــايه الـكروب 📍
〰〰〰〰〰〰〰〰
قفل + الامر / للقفل 📍
فتح + الامر / للفتح  📍
〰〰〰〰〰〰〰〰
📍الصوت
📍الصور المتحركه
📍الصور
📍الفيديو
📍اعاده توجيه
📍التكرار
📍البوتات
📍الروابط
📍المعرف
📍التاك
📍الشارحه
📍الاضافه
📍الاضافه الجماعيه
📍الاشعارات
📍جهات الاتصال
📍الكلايش
📍الدردشه
📍العربيه
📍الانلاين
📍الدخول بالرابط
📍السمايل
  ]].."\n"
.."🛠〰〰〰〰〰〰〰〰〰🛠".."\n"
..'🕵ᴅᴇᴠ🕵: @IH_BI'..'\n'
..'🕵ᴄʜ📡: @Team_Advisor'
------------------
  elseif  matches[1] == "م4" and is_sudo(msg) then 
    return "هلا بيكـ حياتيـ😊❤️ [@"..msg.from.username.."]\n"
  .."  ".."\n"
  ..[[
📍 اوامـــر المــطـــوريـــن  🕵
〰〰〰〰〰〰〰〰
📍 تفعيل 
📍 تعطيل 
📍 رفع المدير 
📍 وضع وقت + عدد الايام
📍 الوقت
📍 اذاعه 
📍 زحلك 
📍 جلب ملف + اسم الملف  
📍 تفعيل + اسم الملف 
📍 تعطيل + اسم للملف
📍 صنع مجموعه + الاسم 
📍 تنظيف + عدد:لمسح رسائل
📍 ترقيه سوبر 
📍 تنشيط - لعمل رن للبوت
📍 تحديث - لتحديث البوت
]]
.."🛠〰〰〰〰〰〰〰〰〰🛠".."\n"
..'🕵ᴅᴇᴠ🕵: @IH_BI'..'\n'
..'🕵ᴄʜ📡: @Team_Advisor'
------------------
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",

  },
  run = run
}
end